{
    "data": [
        {
            "id": 1,
            "name": "Boshel Dog Nail Clippers - Stressfree at Home Grooming",
            "imageFolder": "BoshelDogNailClippers",
            "displayPhoto": "BoshelNailClippers1.jpg",
            "article": "In a time of uncertainty many vets and pet groomers are no longer accepting clients unless it is an emergency. That means that many pet owners have had to resort to doing the most dreaded upkeep task: nail trimming. Trimming a pet’s nails can be stressful for both animal and owner. Some of this stress can easily be relieved if the right products are used. \n That is where the Boshel Dog Nail Clippers come in. This model has everything that you could need for at home trimming. It comes equipped with sharp stainless steel blades that are 3.5mm thick. This design allows for a quick cut because it will trim the nail the first time. Getting a pet to stay still for one cut is hard enough. With this product you will never have to endure the battle of cutting the same nail twice in one sitting. If for some reason your dog does end up with sharp edged nails, simply slide the included nail file out from the left side handle for any extra clean up that may be required. \n Now to address the biggest concern: nicking your dog’s quick by cutting too far up the nail. These clippers will bring you peace of mind that your dog will remain safe and unharmed due to the safety stop. With the safety stop, you have more visibility on how far up on the nail you are cutting. Additionally, the handles of these clippers are a comfy, nonslip, ergonomic handle that will stay secure in your hand to prevent any accidental cuts or nicks. \n To top it all off, this product is backed by trainers, vets, and groomers, along with over 10,000 reviews from happy pet owners. Of course, when using this product, or any similar ones, make sure to still proceed with the utmost caution to ensure the safety of you and your pet. This product is recommended mainly for cats as well as medium and large sized dogs.",
            "tags": [
                "pets"
            ],
            "link": "https://www.amazon.com/dp/B00UJ2WLB0/ref=as_li_ss_tl?&linkCode=ll1&tag=entertainmyli-20&linkId=c725abf1ef97d9347d5a75b606a13b7f&language=en_US",
            "date": "April 25, 2020"
        },
        {
            "id": 2,
            "name": "Waowoo Weighted Blanket - The Perfect Starter Weighted Blanket",
            "imageFolder": "WaowooWeightedBlanket",
            "displayPhoto": "WaowooWeightedBlanket1.jpg",
            "article": "In recent years, the weighted blanket has seen a rise in popularity. Weighted blankets got their start in the 1990s among children. The slight pressure given by the blankets mimics that of a deep touch. While the blankets were originally used to provide comfort to kids and aid in treatment of sensory related disorders, their popularity continues to grow among adults. \n The pressure provided by laying under a weighted blanket releases dopamine and serotonin, which in turn helps to relieve stress. With mental illness numbers on the rise and stressors of life that don’t seem to stop, many adults have turned to weighted blankets to find comfort and relief after a long day. \n Weighted blankets are created by distributing a weighted filling evenly throughout the blanket. Some of these fillings include poly pellets, weighted discs, or glass beads. With the high volume needed to create a weighted sensation, weighted blankets can get very expensive very quickly. That is where the Waowoo Weighted Blanket comes in. At only $40, this weighted blanket is the perfect fit for those who want to try the product but are still on the fence about investing a high amount of money. This blanket is large enough to fit on a queen sized bed and weighs 15 pounds, with options to up the weight and the dimensions of the blanket as the buyer sees fit. With 2, 000+ ratings and 4.5 stars, this product has earned recognition from Amazon to be an Amazon’s Choice item. \n If you have been on the fence about purchasing a weighted blanket, consider this your sign to take the plunge. This is one of the most affordable items of its kind on the market, but the price tag does not mean that it skimps on quality and satisfaction. \n",
            "tags": [
                "home"
            ],
            "link": " //ws-na.amazon-adsystem.com/widgets/q?ServiceVersion=20070822&OneJS=1&Operation=GetAdHtml&MarketPlace=US&source=ac&ref=qf_sp_asin_til&ad_type=product_link&tracking_id=entertainmyli-20&marketplace=amazon&region=US&placement=B07PVLZRHN&asins=B07PVLZRHN&linkId=88a2e9a7477ef8719a092d125a30e339&show_border=false&link_opens_in_new_window=false&price_color=333333&title_color=0066c0&bg_color=ffffff ",
            "date": "April 25, 2020"
        },
        {
            "id": 3,
            "name": "Handmade Felted Slippers - Support Your Feet and a Small Business",
            "imageFolder": "HandmadeFeltedSlippers",
            "displayPhoto": "feltedslippers1.jpg",
            "article": "With the shift from working at places of business to working at home, it is important to practice self care to keep yourself comfortable at home. When practicing this self care, it is important not to skimp out on your feet. With these hand felted slippers, your feet will stay cozy and happy throughout the day. \n Burebure, the company behind these slippers, is based out of Lithuania. The slippers are created largely in part with wool sheared off the sheep that live on the same farm as the business owners. The sheep are raised in the most natural way possible. They roam freely and are sheared by hand twice a year. From there, the wool is felted by hand using only water and natural olive soap - no harsh chemicals required. \n The labor of love that goes into the making of materials for this product also transfers over to the design. These shoes utilize an envelope design that not only makes feet extremely comfy, but also makes them appear smaller. The clever design coupled with the naturally felted wool makes for the most comfortable slippers you can own. Wool is a natural moisture wicker which means that your feet will stay cool on a warm day, and warm on a cool day, all while the wool prevents sweating and massages the feet. \n With various options for customization including colors and sole material, these slippers will be made to suit you in every way you could imagine. This careful consideration of materials does mean a longer shipping time. In the nature of being environmentally friendly and with the goal of waste reduction, slippers will not be made until an order is placed. The 1-3 week shipping time will all be worth it once you have a pair of comfortable, custom designed slippers on your feet. \n",
            "tags": [
                "shopsmall",
                "gear"
            ],
            "link": "https://www.amazon.com/Handmade-Felted-ENVELOPE-Slippers-Europe/dp/B079WTW93Z/ref=as_li_ss_tl?s=handmade&ie=UTF8&qid=1587435529&sr=1-22&linkCode=ll1&tag=entertainmyli-20&linkId=98d0a2effd2b8c8b2c3d8172b00f6c0a&language=en_US",
            "date": "April 25, 2020"
        },
        {
            "id": 4,
            "name": "Minecraft Card Game - Fun for the Whole Family",
            "imageFolder": "MinecraftCardGame",
            "displayPhoto": "minecraft1.jpg",
            "article": "Are you tired of your kids spending so much time playing video games? Are you struggling to find a way to ensure they interact with the family while staying engaged? A foolproof way to engage your kids in activities outside of video games is to find a way to bring the concepts behind the games into your family activities. In comes the Minecraft Card Game from Mattel games. \n Minecraft is a popular video game that allows players to mine for materials that they can use to build buildings, objects, and tools. Just like the virtual game, players start the card game by mining for resources such as wood, stone, iron, diamond, or gold. Once the materials have been obtained, players can use a Craft Card to craft for points. You can craft tools to gain special powers to use in your favor as you work towards the game point total. But look out, Creeper Cards and TNT are lurking in the deck to slow you down. \n With the ties of a wildly popular video game, your kids will keep coming back for more. It allows for relationship building among families as they work to understand and engage in the things that each other loves. Even better, the game is still easy to understand for those who are not familiar with the online game play. Combine the simple provided instructions with a kid who is knowledgeable about the game to fill you in on the lingo, this game is sure to provide hours of fun and family bonding. \n",
            "tags": [
                "kids"
            ],
            "link": "https://www.amazon.com/dp/B0119J9VMI/ref=as_li_ss_tl?ie=UTF8&linkCode=ll1&tag=entertainmyli-20&linkId=84b59c7d2b035c48e4fc4d8e8d68e21a&language=en_US",
            "date": "April 25, 2020"
        },
        {
            "id": 5,
            "name": "Giant Soccer Ball - Giant Fun",
            "imageFolder": "GiantSoccerBall",
            "displayPhoto": "soccerball1.jpg",
            "article": "With summer and the warm weather associated with it quickly approaching, it may be time to expand your arsenal of outdoor toys. Soccer balls have provided hours of fun for years, but eventually, the novelty may wear off. One way to bring the novelty of a soccer ball back in a new and exciting way is to supersize it. Wicked Big Sports has answered the call to bring that excitement. The company offers a new take on the typically 8.5 inch ball with their inflatable soccer ball that measures in at a whopping 18 inches. \n Your purchase of a Wicked Big Sports soccer ball includes the deflated soccer ball, along with one pump and one needle to inflate the ball. It may appear at first that the needle is not included. That is because it is cleverly and safely stored in the handle of the pump. Make sure after your first inflate that you hold onto the pump after the first inflate, because you may need it again. This is not a product that will pop upon the first spin around the yard. It is made of a soft fabric that adds an extra layer of protection with a mesh outside to protect an airbag on the inside. The soft fabric is great for kids, a bonk from this ball will not spring tears to the eyes! If soccer is not your thing, check out related products to see a giant inflatable volleyball and a giant inflatable football from the same company.",
            "tags": [
                "fun",
                "under20"
            ],
            "link": "https://www.amazon.com/dp/B07NR9K983/ref=as_li_ss_tl?th=1&linkCode=ll1&tag=entertainmyli-20&linkId=85ede270fe80968c271c971fcf5c674f&language=en_US",
            "date": "April 25, 2020"
        },
        {
            "id": 6,
            "name": "Tea Gift Set - 8 Different Teas for 8 Different Moods",
            "imageFolder": "TeaSet",
            "displayPhoto": "teaset1.jpg",
            "article": "Tea is a universally loved drink perfect for any and all moods and times. However, with so many choices out there, finding the perfect tea for you can be a challenge. Numi Organic Tea is working to minimize that challenge with their Tea by Mood set. This box, perfect for gifting, comes with 40 bags of tea total, 5 bags per mood. /n This box foxes mainly on blends to hit on a certain mood. Those eight moods are: focus, balance, energize, reflect, invigorate, inspire, refresh, and sleep. With so many mood options and the flavor blends to go along with them, everyone is sure to find at least one thing from this box that they like. Additionally, the different tea blends contain different levels of caffeination to ensure that everyone gets their energy kick, or a relaxing cup that won’t keep them up - whatever they prefer. The organic ingredients use 100% real fruits, flowers, and spices. To top it all off, this box also offers ease of use. The tea leaves come in individually wrapped tea bags to ensure freshness and an easy blend process. \n For more details about each mood and its corresponding blend, see the Amazon listing description for the ingredient list with flavor notes and caffeine level. \n",
            "tags": [
                "fun",
                "home"
            ],
            "link": "https://www.amazon.com/dp/B0102KZ00C/ref=as_li_ss_tl?ie=UTF8&linkCode=ll1&tag=entertainmyli-20&linkId=c91e7a1eb6020f5830732b6c5363f9f6&language=en_US",
            "date": "April 29th, 2020"
        },
        {
            "id": 7,
            "name": "Memory Foam and Gel Seat Cushion - Comfort for Every Situation",
            "imageFolder": "SeatCushion",
            "displayPhoto": "seatcushion1.jpg",
            "article": "Sitting down at a desk all day might seem like an ideal situation, but in reality, it can be quite taxing on your body. Sitting in the same position all day in a desk chair with inadequate support can lead to bad posture, pressure on the coccyx, and back pain. Fixing those issues may seem like a large task. After all, desk chairs are expensive, especially when you start looking at ones that will provide the full amount of support needed. However, the solution is much easier than one might think. ComfLife offers a solution at a fraction of the price of a new chair with their gel enhanced seat cushion. /n This product is made of durable memory foam with a gel cushion and a cool off gel layer. . When placed in your chair, it supports in the tailbone to relieve back pressure. The ergonomic design maximum support to the tailbone, which in turn helps to promote a healthy posture. The seat cushion not only provides this basic level of support, it can also aid in other ongoing problems such as: lower back problems, herniated discs, tailbone injuries, sciatica, and other spinal issues. The cushion can be used at home or in an office, in the car while driving or traveling, as well as in a car seat or wheelchair. /p The cushion is easily portable with a built in handle. It is also guaranteed to stay in place with a non-slip rubber bottom. Additionally, it comes equipped with a machine-washable zippered velour cover to help keep your cushion fresh. It has been rated by over 11,000 people and has a 4.5 star review. As if all of that were not enough, ComLife offers a money back guarantee if you are not satisfied with your product. /n",
            "tags": [
                "home"
            ],
            "link": "https://www.amazon.com/ComfiLife-Gel-Enhanced-Seat-Cushion/dp/B014F18ZGU/ref=as_li_ss_tl?_encoding=UTF8&psc=1&refRID=Q03CCR6SRQFSZEH8V76G&linkCode=ll1&tag=entertainmyli-20&linkId=e6221e111ba236406759d9aa0eccd1a4&language=en_US",
            "date": "April 29th, 2020"
        },
        {
            "id": 8,
            "name": "LapGear Lap Desk - Work Anywhere in Style",
            "imageFolder": "LapDesk",
            "displayPhoto": "lapdesk1.jpg",
            "article": "Working with a laptop somewhere other than a hard top surface is all fun and games until it comes time to set your laptop down somewhere. Does it go on your lap where it is wobbly, does it go on the ground next to you where you have to bend down, do you bite the bullet and sit at a desk? If none of those options sound good, you probably need a lap desk, and LapGear has plenty to choose from. \b With a lap desk, the places that you can work are endless because the flat surface can now be taken anywhere. LapGear has revolutionized the product even further though. In a technology age, no one goes anywhere without their phone, even if their laptop is nearby. LapGear knows this and added a phone slot. The slot is able to hold all cell phones horizontally, and devices up to 7.9 inches vertically. It also comes equipped with an elastic band on the corner to hold things down on your workspace, as well as a plastic ridge on the front of the desk to prevent your laptop from sliding. \n The top portion of the lap desk is wood inspired. The flat, smooth surface allows for improved airflow to ensure that your laptop has the proper ventilation, as recommended by manufacturers. The bottom portion is cushion filling that conforms to your lap to provide an extra level of comfort. The lap desk comes in two sizes: medium (holds up to a 15.6 inch laptop) and large (holds up to a 17.3 inch laptop). Additionally, it is further customizable with 9 different design options that offer a variety of patterns for the cushion and colors and finishes for the top portion. \n",
            "tags": [
                "home",
                "tech"
            ],
            "link": "https://www.amazon.com/LapGear-Designer-Desk-phone-holder/dp/B07N9L5FJJ/ref=as_li_ss_tl?_encoding=UTF8&psc=1&refRID=Q03CCR6SRQFSZEH8V76G&linkCode=ll1&tag=entertainmyli-20&linkId=e0d273193ec46754cef9368a0df76e91&language=en_US",
            "date": "April 29, 2020"
        },
        {
            "id": 9,
            "name": "Bucket List Movie Poster",
            "imageFolder": "MoviePoster",
            "displayPhoto": "movielist2.jpg",
            "article": "Everyone loves a quiet night in. Whether it is every once in a while or more often than not, it can be difficult to pick the perfect activity to do on these nights. For those that love a theme, as well as those that love movies, this product is perfect. It challenges the product owner to watch a list of 100 movies, from classic to new. \b This poster has 100 scratch off spots on it, all for a different movie. Once you watch the movie, you scratch off the square and move on to the next. Not only is it a fun activity, hang it up in the room where you do most of your movie watching and now you have a fun decoration as well. When friends or family see it, it is a good conversation starter as you explain what it is and brag about all of the different movies that you have watched. \n Release dates of the movies on the poster start as early as the 1930s, all the way into the 2010s. Titles range from Disney classics such as The Lion King, to horror classics such as Silence of the Lambs, and onto sci-fi with the Star Wars films. With such a wide array of release dates, genres, and filmmakers, anyone and everyone is guaranteed to find something they like on the list. Even better than finding something you like, the thrill of scratching off all 100 spots on the poster encourages the owner to get out of their comfort zone to watch movies they wouldn’t pick on their own. Going back to old favorites and new to you films is sure to bring hours upon hours of entertainment. \n",
            "tags": [
                "home",
                "fun",
                "under20"
            ],
            "link": "https://www.amazon.com/dp/B075SDQ2K8/ref=as_li_ss_tl?_encoding=UTF8&th=1&linkCode=ll1&tag=entertainmyli-20&linkId=16ae20387f7c367188ebef9121ac6bd6&language=en_US",
            "date": "April 30, 2020"
        },
        {
            "id": 10,
            "name": "Workout Bands - Workout Anywhere Anytime",
            "imageFolder": "WorkoutBands",
            "displayPhoto": "workoutband1.jpg",
            "article": "The decision to begin working out on a quest to a healthier lifestyle is easy in theory, but harder in practice. One of the toughest decisions to make when embarking on the quest for health is where to workout. The gym has all the equipment that you could imagine, but for a newcomer it can be overwhelming. Not to mention the fact that at a gym there may be others there, and you may not be ready to workout with others around. So you come to the decision to work out at home, but now you need at home workout equipment. \n A great place to start with workouts is using resistance bands. Resistance bands are often used in workouts like pilates and yoga, as well as in physical therapy workouts. The bands can be utilized to workout the arms, legs, hips, and shoulders with a variety of different workouts and moves. These bands come in four resistance levels of light, medium, heavy, and extra heavy. The light and medium bands are geared towards beginners, with the heavy and extra heavy best utilized for more intermediate or advanced strength training. \b The bands are made of 100% natural latex that is non-toxic and eco-friendly. This material ensures that the bands are durable and do not cause any skin irritation. The flexibility of this material allows for easy fitting on your body when using the bands, as well as makes them portable. They can easily be folded to fit into a gym bag or even a pocket to allow workouts to take place anywhere at any time. \n",
            "tags": [
                "gear",
                "under20"
            ],
            "link": "https://www.amazon.com/Your-Choice-Resistance-Bands-Exercise/dp/B06XXTH4W6/ref=as_li_ss_tl?_encoding=UTF8&psc=1&refRID=QMAGF91MAQBYRJJTSZVN&linkCode=ll1&tag=entertainmyli-20&linkId=68c9b9ca7e0d46f2959db2d56ab8fcce&language=en_US",
            "date": "April 30, 2020"
        }
    ]
}